{"pageProps":{"objkeyIssues":{"title":"Not a Good and Simple Tax","sub_title":"GST","content":"Over-taxation is theft. A complicated tax regime is a perfect smokescreen to facilitate this theft and was imposed upon us packaged in lies like improving the ease of doing business, improving tax compliance etc. When tax revenues increase with no corresponding increase in government services and welfare provision, the government turns dispossessor and needs to be voted out of power.\n\nWhen the Congress came up with the idea of the Goods and Services Tax (GST), it wanted to bring India under a single tax system instead of the accounting nightmare where different states levied different taxes for the same goods and services. We wanted to cap this tax at 18% in the interest of affordability and to keep up domestic demand for Indian commodities. Modi’s Chief Economic Adviser Arvind Subramanian advocated a lower cap of 15.5% and was summarily ignored. While in the Opposition, the BJP had done its very best to stop the UPA from implementing GST and made sure it was dead on arrival. The Modi Sarkar has ensured that instead of the envisaged ‘Single Rate of Tax’ we have five or six rates of tax, 0.25%, 3%, 5%, 12%, 18%, 28% and 40%, with most goods and services falling in higher brackets like 18% and 28%. This was a deliberate distortion of the vision of the Congress, which according to former Finance Minister P. Chidambaram was: “A ‘single’ GST rate means a standard rate as well as a standard plus rate (on demerit goods) and a standard minus rate (on merit goods). Some goods and services will also be totally exempt.” Instead, the tax-hungry BJP would have us believe that dal should be sold under different GST tax brackets because some of it is “branded”. This designer dal theory is unsurprisingly too rich for the ordinary Indian to stomach. The Modi Sarkar’s Frequent Flier Miles have stopped short of impressing upon them the fact that the most successful economies in the world make sure to minimise the number of tax slabs to one or two and apply them with a great degree of uniformity and predictability.\n\nThe Congress view of GST thus included the following broad fundamentals -\n\n**Single Band Text**\nA single common base, rather than 5, for Centre and State, which subsumes all taxes, capped with a maximum limit of 18%.\n\nCommon Exemptions: Similar exemptions between Centre, State and product categories rather than the system of private lobbying as is the case in the present BJP version of GST.\n\nEasy Compliance: A single, all-powerful GST Network where everyone can file their GST with a single configuration of submission, rather than the convoluted GSTN that currently exists.\n\nContrarily, as things stand, even BJP-ruled governments like Rajasthan are finding it difficult to get a gist of what GST rates they are meant to be applying. Tenders worth approximately Rs. 200 crores have been stuck in the Jaipur Municipal Corporation as neither the government officials nor contractors know what GST rates would be applicable on the tender bills, yet put their bravest face on, to tell the angry public they’ll soon grow to love the Prime Minister’s so-called ‘Good and Simple Tax’.\n\nFiling this Good and Simple Tax has proven more treacherous and complicated for businesses than passing the Cape of Good Hope in an inflatable dingy.  Only 35 lakh businesses out of 75 lakh businesses that migrated to the new system were able to file GST returns for the month of August and this percentage is unlikely to improve soon, not only because of the acrobatics required by armies of Chartered Accountants hired for the purpose of adapting to the BJP’s idea of ease of doing business, but because the Modi Sarkar for all its big talk about e-governance and Digital India can’t even create a website that works without crashing. The company it has tasked with the supremely challenging job of building a website to file this Good and Simple Tax, the Goods and Services Tax Network, admits to not even conducting basic testing of the final version of the software due to a shortage of time and labour. Minister Jaitley, in retrospect, could have bought his hapless team time if he had been so kind as to allow our Parliament to function democratically and discuss the GST bills instead of hurrying them through to escape oversight and score electoral brownie points. Instead, India’s citizens and small businesses must once more be treated like guinea pigs for his half-baked policies, invariably served up with double-speak.\n\nThe BJP’s GST has put the Indian economy in a sticky situation, with GDP growth sliding down to its lowest in three years at only 5.7% in the first (June) quarter of 2017 as a direct result of GST from an already sluggish 6.1%, thanks to the demonetisation disaster. Together GST and demonetisation, the BJP’s most prized silver bullets, have killed the ability of Indian businesses to create or sustain jobs. The All India Manufacturers’ Organisation reports 30% job losses in large export-led industries, 45% job losses in medium and large infrastructure companies and 35% job losses in micro and small businesses. Manufacturing grew only 1.2% this quarter compared to 10.7% in the same quarter last year. While the BJP’s midnight GST launch was star-studded, the high streets the next day were studded with shops that were either closed for business due to the uncertainty or had a frenzy, practically giving away their wares at throwaway prices to claim benefits on old stock. The gluttons in government are boasting that government revenue in August alone was colossal at 93,000 crore rupees, little caring that this has come from administering a death blow to consumer spending and increasing imports. State governments as fifty percent partners in splitting the GST have not even squeaked in protest on behalf of the citizens they’re helping the Modi Sarkar to extort. They fail to realise, that unless there’s an economic turnaround soon with the help of drastically reduced taxes, their windfall is unsustainable.\n\n","coverimage":{"url":"https://res.cloudinary.com/dkplc2mbj/image/upload/v1591942658/gst_0831018a58.jpg"},"uid":"not-a-good-and-simple-tax"}},"__N_SSG":true}